In [1]:
%start Shanmukh

Hello Shanmukh! Welcome to the Pure Kernel.

In [2]:
%%uppercase
Shanmukh raj Mss

SHANMUKH RAJ MSS

In [3]:
%%lowercase
SHANMUKH raj MSS

shanmukh raj mss

In [4]:
%date

2025-06-22 23:22:11

In [5]:
%%python
a = 4
b = 6
print(a+b)

Python code executed successfully.
------Output-----
   10

In [6]:
%%python
a = 4
b = 6
print('a + b is equal to ', a+b)
print('a is equal to ', a)
print('b is equal to ', b)

Python code executed successfully.
------Output-----
   a + b is equal to  10
a is equal to  4
b is equal to  6

In [7]:
sql_to_json_line
SELECT name from employees WHERE salary > 50000;

{
  "_type": "query",
  "orderBy": [],
  "queryBody": {
    "_type": "querySpecification",
    "from": [
      {
        "_type": "table",
        "name": {
          "parts": [
            "employees"
          ]
        }
      }
    ],
    "groupBy": [],
    "orderBy": [],
    "select": {
      "_type": "select",
      "distinct": false,
      "selectItems": [
        {
          "_type": "singleColumn",
          "expression": {
            "_type": "qualifiedNameReference",
            "name": {
              "parts": [
                "name"
              ]
            }
          }
        }
      ]
    },
    "where": {
      "_type": "comparisonExpression",
      "left": {
        "_type": "qualifiedNameReference",
        "name": {
          "parts": [
            "salary"
          ]
        }
      },
      "operator": "GREATER_THAN",
      "right": {
        "_type": "integerLiteral",
        "value": 50000
      }
    }
  }
}

In [8]:
sql_to_json_batch
SELECT * FROM customers;
SELECT id, name FROM products

{
  "errors": {},
  "result": {
    "query1": {
      "_type": "query",
      "orderBy": [],
      "queryBody": {
        "_type": "querySpecification",
        "from": [
          {
            "_type": "table",
            "name": {
              "parts": [
                "customers"
              ]
            }
          }
        ],
        "groupBy": [],
        "orderBy": [],
        "select": {
          "_type": "select",
          "distinct": false,
          "selectItems": [
            {
              "_type": "allColumns"
            }
          ]
        }
      }
    },
    "query2": {
      "_type": "query",
      "orderBy": [],
      "queryBody": {
        "_type": "querySpecification",
        "from": [
          {
            "_type": "table",
            "name": {
              "parts": [
                "products"
              ]
            }
          }
        ],
        "groupBy": [],
        "orderBy": [],
        "select": {
          "_type": "select",
          "distinct": false,
          "selectItems": [
            {
              "_type": "singleColumn",
              "expression": {
                "_type": "qualifiedNameReference",
                "name": {
                  "parts": [
                    "id"
                  ]
                }
              }
            },
            {
              "_type": "singleColumn",
              "expression": {
                "_type": "qualifiedNameReference",
                "name": {
                  "parts": [
                    "name"
                  ]
                }
              }
            }
          ]
        }
      }
    }
  }
}

In [9]:
create mywarehouse::mydatabase::myschema::mytable(id [int] [primarykey], name [string])

-----------------Table Created-----------------
-----Ware House: mywarehouse-----
-----DataBase: mydatabase-----
-----Schema: myschema-----
-----Columns-----
id[int] is a Primary Key
name[string]

In [10]:
create warehouse1::db1::schema1::employee(id [int] [primarykey], name [string], age [int], salary [float], isActive [boolean])

-----------------Table Created-----------------
-----Ware House: warehouse1-----
-----DataBase: db1-----
-----Schema: schema1-----
-----Columns-----
id[int] is a Primary Key
name[string]
age[int]
salary[float]
isActive[boolean]

In [11]:
create warehouse1::db1::schema1::employee(id [int], name [string] [primarykey], age [int], salary [float], isActive [boolean])

-----------------Table Created-----------------
-----Ware House: warehouse1-----
-----DataBase: db1-----
-----Schema: schema1-----
-----Columns-----
id[int]
name[string] is a Primary Key
age[int]
salary[float]
isActive[boolean]

In [12]:
insertrow
[id: 1, name: 'Alice', age: 25, isActive: true] -> warehouse1::db1::schema1::table1

In [13]:
insertrow
[id: 1, name: 'Alice', age: 25, isActive: true] -> warehouse1::db1::schema1::employee

In [14]:
insertrow
[id: 1, name: 'Alice', age: 25, salary: 25000.00, isActive: True] -> warehouse1::db1::schema1::employee

Row Added.
(age: 25, id: 1, isActive: True, name: Alice, salary: 25000.0)

In [15]:
insertrow
[id: 1, name: 'Alice', age: 25, salary: 25000.00, isActive: "True"] -> warehouse1::db1::schema1::employee

In [16]:
insertrow
[id: 1, name: 'Alice', age: 25, salary: 25000.00, isActive: True] -> warehouse1::db1::schema1::employee

In [17]:
insertrow
[id: 1, name: 'Alice', age: 25, salary: 25000.00, isActive: 'True'] -> warehouse1::db1::schema1::employee

In [18]:
insertrow
[id: 1, name: 'Alice', age: 25, salary: 25000.00, isActive: true] -> warehouse1::db1::schema1::employee

In [19]:
insertrow
[id: 1, name: "Bob", age: 25, salary: 25000.00, isActive: True] -> warehouse1::db1::schema1::employee

Row Added.
(age: 25, id: 1, isActive: True, name: Bob, salary: 25000.0)

In [20]:
show_all_tables

Number of tables: 2
Tables:
mywarehouse::mydatabase::myschema::mytable
warehouse1::db1::schema1::employee

In [21]:
show_table
warehouse1::db1::schema1::employee

   age  id  isActive   name   salary
0   25   1      True  Alice  25000.0
1   25   1      True    Bob  25000.0

In [22]:
show_table
mywarehouse::mydb::myschema::employee

In [23]:
insertrow
[id: 1, name: "Chloe", age: 22, salary: 15000.00, isActive: False] -> warehouse1::db1::schema1::employee

Row Added.
(age: 22, id: 1, isActive: False, name: Chloe, salary: 15000.0)

In [24]:
show_table
warehouse1::db1::schema1::employee

   age  id  isActive   name   salary
0   25   1      True  Alice  25000.0
1   25   1      True    Bob  25000.0
2   22   1     False  Chloe  15000.0

In [25]:
delete_row
warehouse1::db1::schema1::employee::0

Row deleted successfully:
(age: 25, id: 1, isActive: True, name: Alice, salary: 25000.0)

In [26]:
show_table
warehouse1::db1::schema1::employee

   age  id  isActive   name   salary
0   25   1      True    Bob  25000.0
1   22   1     False  Chloe  15000.0

In [27]:
load duckdb
/home/shannu/Documents/CSV/employee.csv

CSV loaded as table 'employee' in file: /home/shannu/Documents/CSV/employee.duckdb

In [28]:
query duckdb /home/shannu/Documents/CSV/employee.duckdb
SELECT * FROM employee LIMIT 10

   COMMISSION_PCT  DEPARTMENT_ID     EMAIL  ...  MANAGER_ID  PHONE_NUMBER SALARY
0               0             50  DOCONNEL  ...         124  650.507.9833   2600
1               0             50    DGRANT  ...         124  650.507.9844   2600
2               0             10   JWHALEN  ...         101  515.123.4444   4400
3               0             20  MHARTSTE  ...         100  515.123.5555  13000
4               0             20      PFAY  ...         201  603.123.6666   6000
5               0             40   SMAVRIS  ...         101  515.123.7777   6500
6               0             70     HBAER  ...         101  515.123.8888  10000
7               0            110  SHIGGINS  ...         101  515.123.8080  12008
8               0            110    WGIETZ  ...         205  515.123.8181   8300
9               0             90     SKING  ...           0  515.123.4567  24000

[10 rows x 11 columns]

In [29]:
query duckdb /home/shannu/Documents/CSV/employee.duckdb
SELECT FIRST_NAME FROM employee LIMIT 10;

  FIRST_NAME
0     Donald
1    Douglas
2   Jennifer
3    Michael
4        Pat
5      Susan
6    Hermann
7    Shelley
8    William
9     Steven

In [30]:
query duckdb /home/shannu/Documents/CSV/employee.duckdb
SELECT FIRST_NAME 
FROM employee LIMIT 10;

  FIRST_NAME
0     Donald
1    Douglas
2   Jennifer
3    Michael
4        Pat
5      Susan
6    Hermann
7    Shelley
8    William
9     Steven